ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32_WordClockV205/ESP32_WordClockV205.ino
/* 
 Author      : Ed Nieuwenhuys ednieuw.nl
 Changes V001: Derived from ESP32C3S3_WordClockV026.ino
 Changes V003: Clock and SK6812 LEDstrip working
...
 Changes V094: Replaced NIMBLE with ESP32 BLE
...
 Changes V130: Removed old coding and use NEOPIXEL and use ESPAsyncWebServer. 203222 l/s again instead of 140000
...
 Changes V199: All Rework in Webpage to CheckWIFIcommand(). 199a Clock logic in ClockLogic.h. Corrected double Menu i and ii on webpage when BLE open.
               Updated HTML and logging behaviour. Added option V background, Changed LDR reading when background is on, input decimal or hexadecimal, KURZ, EXACT etc bij Ulrich 4-talen weg
               Removed short LDR reading under X LDR_LED. NoTextInLeds in EveryHourUpdate -> end of function 
               lastminute = 99; -> end ReworkInputString .Cleanup code. 
 Changes V200: OTA logic improved
 Changes V201: LED near LDR on/off 
 Changes V202: HET IS WAS can also OFF in FOURLANGUAGECLOCK and VIERTALENKLOK
 Changes V203: Added CLOCK_VARIANT. renamed Mem.UseRotary -> Mem.TimeInput
 Changes V204: Resetbutton added  
 Changes V205: BLE bugs solved. Android did not see the broadcastname, uses now  pServer->disconnect()  

*********************
How to compile: 
Install ESP32 boards
Board: ESP32 core version >3.2.0 
Partition Scheme: With FAT
Pin Numbering: By Arduino pin (default)     -- > with EdsoftLED both can be used
               By GPIO number (legacy)      -- > When using NEOpixel   Adafruit_NeoPixel/esp.c:78:(.text.espShow+0x55): undefined reference to `digitalPinToGPIONumber' when using By Arduino pin
USB mode: Normal (Tiny USB)
**********************

Select below, with only one #define selected, the clock variant

*/
// =============================================================================================================================
// ------------------>   Define only one clock type
#define NL144CLOCK              // Dutch display for 12 x 12 Front
//#define FOURLANGUAGECLOCK       // Four-language clock with 625 LEDs 
//#define NL92CLOCK               // Dutch display for one LED behind every character
//#define NLM1M2M3M4L161          // NL EdSoft Qclock design
//#define DE144CLOCK              // German display for 12 x 12 Front
//#define NLM1M2M3M4L94           // NL clock with four extra LEDs for the minutes to light up 
//#define NLM1M2M3M4L114          // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L144          // NL clock with four extra LEDs for the minutes to light up 
//#define NLM1M2M3M4L256          // NL clock with four extra LEDs for the minutes to light up
//#define VIERTALENKLOK           // Viertalenklok Ulrich

//------------------------------------------------------------------------------              //
// ESP32 Definition of installed modules
// Define the modules installed in the clock by removing the // before the #define
//--------------------------------------------
//#define ONEWIREKEYPAD3x1       // Use a 3x1 keypad with one wire
//#define ONEWIREKEYPAD3x4       // Use a 3x4 keypad with one wire

//------------------------------------------------------------------------------              //
// ESP32 Includes defines and initialisations
//-------------------------------------------
                      #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL (3, 3, 7)            // Use EdSoftLED with ESP32 compiler.
#define USEEDSOFTLED  // Use EdsoftLED >= V1.7.0 for SK6812. Saves 200-500 bytes compared with NeoPixel. To use NeoPixel is also OK
                      #endif
                      #ifdef USEEDSOFTLED
#include <EdSoftLED.h>         // https://github.com/ednieuw/EdSoftLED for LED strip WS2812 or SK6812 
                      #else
#include <Adafruit_NeoPixel.h> // https://github.com/adafruit/Adafruit_NeoPixel  *** USE GPIO NUMBERING and compile By GPIO number (legacy) 
                      #endif
#include <Preferences.h>
#include <NimBLEDevice.h>      // For BLE communication. !!!Use NimBLE version 2.x.x  https://github.com/h2zero/NimBLE-Arduino
#include <WiFi.h>              // Used for web page 
#include <esp_sntp.h>          // for NTP
#include <esp_wps.h>           // For WPS
#include <ESPAsyncWebServer.h> // Used for webpage  https://github.com/ESP32Async 
#include <Update.h>            // For Over-the-Air (OTA)
#include <ESPmDNS.h>           // To show BLEname in router
#include <DNSServer.h>         // For the web page to enter SSID and password of the WIFI router 
#include <Wire.h>              // Ter zijner tijd Wire functies gaan gebruiken. Staan al klaar in de code 
#include <RTClib.h>            // Used for connected DS3231 RTC // Reference https://adafruit.github.io/RTClib/html/class_r_t_c___d_s3231.html
#include <Encoder.h>           // For rotary encoder
#include <Keypad.h>            // For 3x1 membrane keypad instead of rotary encoder by Mark Stanley & Alexander Brevig 
#include <IRremote.hpp>        // IR remote control

// Ergens bovenaan je code, na alle #defines:
constexpr const char* CLOCK_VARIANT =
  #if defined(NL144CLOCK)
    "NL144CLOCK"
  #elif defined(FOURLANGUAGECLOCK)
    "FOURLANGUAGECLOCK"
  #elif defined(NL92CLOCK)
    "NL92CLOCK"
  #elif defined(NLM1M2M3M4L161)
    "NLM1M2M3M4L161"
  #elif defined(DE144CLOCK)
    "DE144CLOCK"
  #elif defined(NLM1M2M3M4L94)
    "NLM1M2M3M4L94"
  #elif defined(NLM1M2M3M4L114)
    "NLM1M2M3M4L114"
  #elif defined(NLM1M2M3M4L144)
    "NLM1M2M3M4L144"
  #elif defined(NLM1M2M3M4L256)
    "NLM1M2M3M4L256"
  #elif defined(VIERTALENKLOK)
    "VIERTALENKLOK"
  #else
    "UNKNOWN"
  #endif
;

//------------------------------------------------------------------------------              //
// SPIFFS storage
//--------------------------------------------
Preferences FLASHSTOR;

//------------------------------------------------------------------------------              //
// COLOURS stored in Mem.DisplayChoice
//--------------------------------------------   

const byte DEFAULTCOLOUR = 0;
const byte HOURLYCOLOUR  = 1;          
const byte WHITECOLOR    = 2;
const byte OWNCOLOUR     = 3;
const byte OWNHETISWAS   = 4;
const byte WHEELCOLOR    = 5;
const byte DIGITAL       = 6;
const byte HOURHETISWAS  = 7;
const byte RAINBOW       = 8;
const byte LASTITEM      = 8;                                                                 // Last display choice item number

